/**************************************************************************************************
* 张飞实战电子
* @project Svpwm
* @file    Main.c
* @author  张飞实战电子团队
* @date    2024/03/28
* @version V100
* @Copyright  软件著作权张飞实战电子所有
**************************************************************************************************/
#include "..\Include\Main.h"

/**************************************************************************************************
* 初始化及主循环
**************************************************************************************************/
int Main(void)
{
	Initialize();
    
	tSystem.Delay = 100;	
	while(tSystem.Delay){};
      
    tGlobal.CoreIndex = 1;
      
	while(1)
    {
        
    }
}
/*===============================================================================================*/
void ADC1_2_IRQHandler(void)
{
    unsigned int Temp;
    
    Temp = ADC1->ISR;
    
    if((Temp & 0x00000040) != 0)
    {
        ADC1->ISR |= 0x00000040;
        
        AdcSample();  			
		CoreMachine();				   	
		SysTimeCount();
    }
}
/*===============================================================================================*/
static void SysTimeCount(void)
{
	tSystem.Tick ++;
	if (tSystem.Tick >= 25)
	{
		tSystem.Tick = 0;
			
		if (tSystem.Delay)
			tSystem.Delay --;
	}	
}	
/************************ (C) COPYRIGHT Zhang Fei Shi Zhan Dian Zi *******************************/
