/**************************************************************************************************
 * 张飞实战电子
 * @project Svpwm
 * @file    Adc.h
 * @author  张飞实战电子团队
 * @date    2024/03/28
 * @version V100
 * @Copyright  软件著作权张飞实战电子所有
 **************************************************************************************************/
#include "userMain.h"

void AdcSample(void);

// tAdc_Type tAdc;
/************************ (C) COPYRIGHT Zhang Fei Shi Zhan Dian Zi *******************************/
